When we want to work with SQL easily in an Ipython notebook, we'll load the ipython-sql [extension](https://github.com/catherinedevlin/ipython-sql) as follows:

In [1]:
%load_ext sql

**Note:** Don't worry if you get (a) a big red-highlighted warning or (b) a note that the extension has already been loaded!  As long as your SQL commands work, it's loaded properly!

Next, we'll load an SQLite database stored as a file as follows:

**NOTE: in general, we load a file- for example, "dataset_1.db" here, which you'll use throughout the next few lectures + PS1- which must be in the same directory as the IPython Notebook for this to work.  Make sure to download it!**

In [2]:
%sql sqlite:///dataset_1.db

u'Connected: None@dataset_1.db'

Lets look at one table from the US National Oceanic and Atmospheric Administration (NOAA) Rainfall dataset- `precipitation_full`- having the following schema:

> * `state_code`
> * `station_id`
> * `year`
> * `month`
> * `day`
> * `hour`
> * `precipitation`
> * `flag_1`
> * `flag_2`

Each tuple in this table describes one hour of rainfall (`precipitation`- in hundredths of an inch) at one station (`station_id`) in one state (`state_code`).  Note that tuples with `hour=25` record the total rainfall for that day, and that we can ignore the values of attributes `flag_1` and `flag_2` for now.

Let's take a look at some sample rows:

Note that you can also load an empty in-memory database using:

``%sql sqlite://``

Now let's try out some queries!  (Don't worry, if you're new to SQL, we'll go over all the syntax in more depth next lecture)

**`%sql` is used for single line SQL commands:**

In [4]:
%sql SELECT * FROM precipitation_full LIMIT 6;

Done.

[(1, 807, 2013, 9, 1, 1, None, u'[', u''),
 (1, 807, 2013, 9, 1, 25, 0, u'I', u''),
 (1, 807, 2013, 9, 30, 24, None, u']', u''),
 (1, 807, 2013, 9, 30, 25, 0, u'I', u''),
 (1, 6303, 2013, 9, 1, 1, 0, u'g', u''),
 (1, 6303, 2013, 9, 1, 25, 0, u'', u'')]

In [5]:
%sql SELECT state_code, station_id,flag_1 FROM precipitation_full LIMIT 10;

Done.

[(1, 807, u'['),
 (1, 807, u'I'),
 (1, 807, u']'),
 (1, 807, u'I'),
 (1, 6303, u'g'),
 (1, 6303, u''),
 (1, 6303, u''),
 (1, 6303, u''),
 (1, 6303, u''),
 (1, 6303, u'')]

In [6]:
%sql SELECT COUNT(*) FROM precipitation_full;

Done.

[(74251,)]

And **`%%sql` is used for multi-line SQL commands:**

In [16]:
%%sql
SELECT SUM(p.precipitation) AS totalprecipitation
FROM precipitation_full p, states s 
WHERE p.state_code = s.code AND s.abbrev = 'CA';

Done.

[(31982,)]

In [9]:
%sql SELECT name FROM sqlite_master WHERE type='table';

Done.

[(u'precipitation_full',),
 (u'states',),
 (u'precipitation',),
 (u'A',),
 (u'B',),
 (u'streets',),
 (u'franchise',),
 (u'store',),
 (u'bagel',),
 (u'purchase',)]

We can also work with the output of the queries we issue:

In [11]:
result = %sql SELECT * FROM states;

Done.

In [12]:
result.keys

[u'code', u'name', u'abbrev']

*Note that the first row is the header row with column names!*

In [15]:
print result

+------+----------------------+--------------+
| code |         name         |    abbrev    |
+------+----------------------+--------------+
|  0   |        State         | Abbreviation |
|  1   |       Alabama        |      AL      |
|  2   |       Arizona        |      AZ      |
|  3   |       Arkansas       |      AR      |
|  4   |      California      |      CA      |
|  5   |       Colorado       |      CO      |
|  6   |     Connecticut      |      CT      |
|  7   |       Delaware       |      DE      |
|  8   | District of Columbia |      DC      |
|  9   |       Florida        |      FL      |
|  10  |       Georgia        |      GA      |
|  11  |        Idaho         |      ID      |
|  12  |       Illinois       |      IL      |
|  13  |       Indiana        |      IN      |
|  14  |         Iowa         |      IA      |
|  15  |        Kansas        |      KS      |
|  16  |       Kentucky       |      KY      |
|  17  |      Louisiana       |      LA      |
|  18  |        Maine         |      ME      |
|  19  |       Montana        |      MT      |
|  20  |       Nebraska       |      NE      |
|  21  |        Nevada        |      NV      |
|  22  |    New Hampshire     |      NH      |
|  23  |      New Jersey      |      NJ      |
|  24  |      New Mexico      |      NM      |
|  25  |       New York       |      NY      |
|  26  |    North Carolina    |      NC      |
|  27  |     North Dakota     |      ND      |
|  28  |         Ohio         |      OH      |
|  29  |       Oklahoma       |      OK      |
|  30  |        Oregon        |      OR      |
|  31  |       Maryland       |      MD      |
|  32  |    Massachusetts     |      MA      |
|  33  |       Michigan       |      MI      |
|  34  |      Minnesota       |      MN      |
|  35  |     Mississippi      |      MS      |
|  36  |       Missouri       |      MO      |
|  37  |     Pennsylvania     |      PA      |
|  38  |     Rhode Island     |      RI      |
|  39  |    South Carolina    |      SC      |
|  40  |     South Dakota     |      SD      |
|  41  |      Tennessee       |      TN      |
|  42  |        Texas         |      TX      |
|  43  |         Utah         |      UT      |
|  44  |       Vermont        |      VT      |
|  45  |       Virginia       |      VA      |
|  46  |      Washington      |      WA      |
|  47  |    West Virginia     |      WV      |
|  48  |      Wisconsin       |      WI      |
|  49  |       Wyoming        |      WY      |
|  50  |        Alaska        |      AK      |
|  51  |        Hawaii        |      HI      |
|  66  |     Puerto Rico      |      PR      |
|  67  |    Virgin Islands    |      VI      |
|  91  |   Pacific Islands    |      PI      |
+------+----------------------+--------------+

In [13]:
result[1]

(1, u'Alabama', u'AL')

In [14]:
result[1].name

u'Alabama'

Now feel free to have fun with the dataset- we'll see more of it later though!